app/controllers/v1/restaurants_controller.rb

  def index
    restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
    restaurant_id = params["id"]
    restaurant = Restaurant.find_by(id: restaurant_id)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]