app/controllers/v1/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    reviews = Review.all